Revit 2027 API
IFCData.CreateIntegerOfType Method
 Creates an integer data object of the specified type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateIntegerOfType(
	int value,
	string typeName
)
Public Shared Function CreateIntegerOfType (
	value As Integer,
	typeName As String
) As IFCData
public:
static IFCData^ CreateIntegerOfType(
	int value,
	String^ typeName
)
static member CreateIntegerOfType :
        value : int *
        typeName : string -> IFCData
Parameters
value Int32
 The integer value.
typeName String
 The type name.
Return Value
IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace